---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.StructuralConnectionFailures
source: html/de96ae77-a5a6-eec0-bd9a-25129a2f69be.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StructuralConnectionFailures

Failures about StructuralConnectionHandler.

## Syntax (C#)
```csharp
public static class StructuralConnectionFailures
```